if ($response.statusCode != 200) {
  $done(null);
}

const flags = new Map([
["AC", "🇦🇨"], ["AD", "🇦🇩"], ["AE", "🇦🇪"], ["AF", "🇦🇫"], ["AG", "🇦🇬"], ["AI", "🇦🇮"], ["AL", "🇦🇱"], ["AM", "🇦🇲"], ["AO", "🇦🇴"], ["AQ", "🇦🇶"], ["AR", "🇦🇷"], ["AS", "🇦🇸"],
["AT", "🇦🇹"], ["AU", "🇦🇺"], ["AW", "🇦🇼"], ["AX", "🇦🇽"], ["AZ", "🇦🇿"], ["BA", "🇧🇦"], ["BB", "🇧🇧"], ["BD", "🇧🇩"], ["BE", "🇧🇪"], ["BF", "🇧🇫"], ["BG", "🇧🇬"], ["BH", "🇧🇭"],  
["BI", "🇧🇮"], ["BJ", "🇧🇯"], ["BM", "🇧🇲"], ["BN", "🇧🇳"], ["BO", "🇧🇴"], ["BR", "🇧🇷"], ["BS", "🇧🇸"], ["BT", "🇧🇹"], ["BV", "🇧🇻"], ["BW", "🇧🇼"], ["BY", "🇧🇾"], ["BZ", "🇧🇿"], 
["CA", "🇨🇦"], ["CD", "🇨🇩"], ["CF", "🇨🇫"], ["CG", "🇨🇬"], ["CH", "🇨🇭"], ["CI", "🇨🇮"], ["CK", "🇨🇰"], ["CL", "🇨🇱"], ["CM", "🇨🇲"], ["CN", "🇨🇳"], ["CO", "🇨🇴"], ["CP", "🇨🇵"], 
["CR", "🇨🇷"], ["CU", "🇨🇺"], ["CV", "🇨🇻"], ["CW", "🇨🇼"], ["CX", "🇨🇽"], ["CY", "🇨🇾"], ["CZ", "🇨🇿"], ["DE", "🇩🇪"], ["DG", "🇩🇬"], ["DJ", "🇩🇯"], ["DK", "🇩🇰"], ["DM", "🇩🇲"],
["DO", "🇩🇴"], ["DZ", "🇩🇿"], ["EA", "🇪🇦"], ["EC", "🇪🇨"], ["EE", "🇪🇪"], ["EG", "🇪🇬"], ["EH", "🇪🇭"], ["ER", "🇪🇷"], ["ES", "🇪🇸"], ["ET", "🇪🇹"], ["EU", "🇪🇺"], ["FI", "🇫🇮"],
["FJ", "🇫🇯"], ["FK", "🇫🇰"], ["FM", "🇫🇲"], ["FO", "🇫🇴"], ["FR", "🇫🇷"], ["GA", "🇬🇦"], ["GB", "🇬🇧"], ["GD", "🇬🇩"], ["GE", "🇬🇪"], ["GF", "🇬🇫"], ["GH", "🇬🇭"], ["GI", "🇬🇮"],
["GL", "🇬🇱"], ["GM", "🇬🇲"], ["GN", "🇬🇳"], ["GP", "🇬🇵"], ["GR", "🇬🇷"], ["GT", "🇬🇹"], ["GU", "🇬🇺"], ["GW", "🇬🇼"], ["GY", "🇬🇾"], ["HK", "🇭🇰"], ["HN", "🇭🇳"], ["HR", "🇭🇷"],
["HT", "🇭🇹"], ["HU", "🇭🇺"], ["ID", "🇮🇩"], ["IE", "🇮🇪"], ["IL", "🇮🇱"], ["IM", "🇮🇲"], ["IN", "🇮🇳"], ["IR", "🇮🇷"], ["IS", "🇮🇸"], ["IT", "🇮🇹"], ["JM", "🇯🇲"], ["JO", "🇯🇴"],
["JP", "🇯🇵"], ["KE", "🇰🇪"], ["KG", "🇰🇬"], ["KH", "🇰🇭"], ["KI", "🇰🇮"], ["KM", "🇰🇲"], ["KN", "🇰🇳"], ["KP", "🇰🇵"], ["KR", "🇰🇷"], ["KW", "🇰🇼"], ["KY", "🇰🇾"], ["KZ", "🇰🇿"],
["LA", "🇱🇦"], ["LB", "🇱🇧"], ["LC", "🇱🇨"], ["LI", "🇱🇮"], ["LK", "🇱🇰"], ["LR", "🇱🇷"], ["LS", "🇱🇸"], ["LT", "🇱🇹"], ["LU", "🇱🇺"], ["LV", "🇱🇻"], ["LY", "🇱🇾"], ["MA", "🇲🇦"],
["MC", "🇲🇨"], ["MD", "🇲🇩"], ["MG", "🇲🇬"], ["MH", "🇲🇭"], ["MK", "🇲🇰"], ["ML", "🇲🇱"], ["MM", "🇲🇲"], ["MN", "🇲🇳"], ["MO", "🇲🇴"], ["MP", "🇲🇵"], ["MQ", "🇲🇶"], ["MR", "🇲🇷"],
["MS", "🇲🇸"], ["MT", "🇲🇹"], ["MU", "🇲🇺"], ["MV", "🇲🇻"], ["MW", "🇲🇼"], ["MX", "🇲🇽"], ["MY", "🇲🇾"], ["MZ", "🇲🇿"], ["NA", "🇳🇦"], ["NC", "🇳🇨"], ["NE", "🇳🇪"], ["NF", "🇳🇫"],
["NG", "🇳🇬"], ["NI", "🇳🇮"], ["NL", "🇳🇱"], ["NO", "🇳🇴"], ["NP", "🇳🇵"], ["NR", "🇳🇷"], ["NZ", "🇳🇿"], ["OM", "🇴🇲"], ["PA", "🇵🇦"], ["PE", "🇵🇪"], ["PF", "🇵🇫"], ["PG", "🇵🇬"],
["PH", "🇵🇭"], ["PK", "🇵🇰"], ["PL", "🇵🇱"], ["PM", "🇵🇲"], ["PR", "🇵🇷"], ["PS", "🇵🇸"], ["PT", "🇵🇹"], ["PW", "🇵🇼"], ["PY", "🇵🇾"], ["QA", "🇶🇦"], ["RE", "🇷🇪"], ["RO", "🇷🇴"],
["RS", "🇷🇸"], ["RU", "🇷🇺"], ["RW", "🇷🇼"], ["SA", "🇸🇦"], ["SB", "🇸🇧"], ["SC", "🇸🇨"], ["SD", "🇸🇩"], ["SE", "🇸🇪"], ["SG", "🇸🇬"], ["SI", "🇸🇮"], ["SK", "🇸🇰"], ["SL", "🇸🇱"],
["SM", "🇸🇲"], ["SN", "🇸🇳"], ["SR", "🇸🇷"], ["ST", "🇸🇹"], ["SV", "🇸🇻"], ["SY", "🇸🇾"], ["SZ", "🇸🇿"], ["TC", "🇹🇨"], ["TD", "🇹🇩"], ["TG", "🇹🇬"], ["TH", "🇹🇭"], ["TJ", "🇹🇯"],
["TL", "🇹🇱"], ["TM", "🇹🇲"], ["TN", "🇹🇳"], ["TO", "🇹🇴"], ["TR", "🇹🇷"], ["TT", "🇹🇹"], ["TV", "🇹🇻"], ["TW", "🇨🇳"], ["TZ", "🇹🇿"], ["UA", "🇺🇦"], ["UG", "🇺🇬"], ["UK", "🇬🇧"],
["UM", "🇺🇲"], ["US", "🇺🇸"], ["UY", "🇺🇾"], ["UZ", "🇺🇿"], ["VA", "🇻🇦"], ["VC", "🇻🇨"], ["VE", "🇻🇪"], ["VG", "🇻🇬"], ["VI", "🇻🇮"], ["VN", "🇻🇳"], ["VU", "🇻🇺"], ["WS", "🇼🇸"],
["YE", "🇾🇪"], ["YT", "🇾🇹"], ["ZA", "🇿🇦"], ["ZM", "🇿🇲"], ["ZW", "🇿🇼"]
]);

const country0 = "MUC";
const region0 = "韦恩大厦";
const city0 = "高谭市";
const isp0 = "MCU.com";


// 脚本开始
let body = $response.body;
let obj = JSON.parse(body);

const country = country_ValidCheck(obj['country']);
const region = Area_check(obj['regionName']);
const city = City_ValidCheck(obj['city']);

let displayCity = (city !== country && city !== region) ? city : '';

let title = flags.get(obj['countryCode']) + ' ' + country + ' ' + region;
let subtitle = (displayCity ? displayCity + ' ' : '') + obj['query'] + ' ' + ISP_ValidCheck(obj['isp']);

let ip = obj['query'];
let description = '国家：' + obj['countryCode'] + ' ' + country + '\n'
  + '地区：' + obj['region'] + ' ' + region + '\n'
  + 'IP：' + obj['query'] + '\n'
  + '服务商：' + obj['isp'] + '\n'
  + '经纬度：' + obj['lat'] + ' / ' + obj['lon'] + '\n'
  + '时区：' + obj['timezone'];

$done({title, subtitle, ip, description});



function country_ValidCheck(para) {
   const countryMap = {
     "中華民國":"台湾", "中华民国":"台湾","俄罗斯联邦":"俄罗斯",
     };
 para = para ? para.trim() : "";
 return countryMap[para] || para || country0;
};

function Area_check(para) {
  const areaMap = {
    // 亚美尼亚（Armenia） - AM
    "葉里溫": "叶里温",

    // 阿根廷（Argentina） - AR
    "圣地亚哥首都大区": "圣地亚哥大区",

    // 澳大利亚（Australia） - AU
    "victoria": "维多利亚州",
    "new south wales": "新南威尔士州",

    // 阿塞拜疆（Azerbaijan） - AZ
    "baku city": "巴库市",

    // 巴西（Brazil） - BR
    "Sao Paulo": "圣保罗", "聖保羅州": "圣保罗州",

    // 保加利亚（Bulgaria） - BG
    "sofia-capital": "索菲亚市",

    // 加拿大（Canada） - CA
    "quebec": "魁北克市",

    // 哥伦比亚（Colombia） - CO
    "bogota d.c.": "波哥大首都",

    // 瑞士（Switzerland） - CH
    "lombardy": "伦巴第大区",
    
    // 中国（China） - CN
    "changhua": "彰化县", "taichung city": "台中市", "taoyuan": "桃园市", "臺灣省 or 台灣省": "中部地区", "臺北市": "台北市", "中西區": "中西区",
    
    // 法国（France） - FR
    "tassin-la-demi-lune": "塔桑拉德米吕讷", "Île-de-france": "法兰西岛", "奧弗涅-羅訥-阿爾卑斯大區": "阿尔卑斯大区", "普罗旺斯-阿尔卑斯-蔚蓝海岸大区": "蔚蓝海岸大区",

    // 英国（United Kingdom） - GB
    "wales": "威尔士",

    // 冰岛
    "southern peninsula": "南部半岛",

    // 立陶宛（Lithuania） - LT
    "維爾紐斯縣": "维尔纽斯县",

    // 拉脱维亚（Latvia） - LV
    "rīga": "里加", "rucka": "鲁卡镇",

    // 马来西亚（Malaysia） - MY
    "ampang": "安邦", "kuala lumpur": "吉隆坡", "雪兰莪": "雪兰莪州",

    // 摩洛哥（Morocco） - MA
    "marrakesh-safi": "马拉喀什大区",

    // 尼泊尔（Nepal） - NP
    "bagmati province": "巴格马蒂省",

    // 荷兰（Netherlands） - NL
    "luxembourg": "卢森堡市",

    // 俄罗斯（Russia） - RU
    "moscow": "莫斯科", "st.-petersburg": "圣彼得堡",

    // 塞尔维亚（Serbia） - RS
    "belgrade": "贝尔格莱德", "central serbia": "中部地区",

    // 新加坡（Singapore） - SG
    "central singapore": "中区", "south west": "西南区", "south east": "东南区",

    // 泰国（Thailand） - TH
    "ang thong": "红统府",  "nonthaburi": "暖武里省",

    // 台湾（Taiwan） - TW
    "聖保羅州": "圣保罗州",

    // 香港（Hong Kong） - HK
    "tsuen wan district": "荃湾区",

    // 土耳其（Turkey） - TR
    "imārat umm al qaywayn": "乌姆盖万", "kocasinan": "科卡西楠市",

    // 乌克兰（Ukraine） - UA
    "kyiv city": "基辅市",

    // 美国（United States） - US
    "加州": "加利福尼亚州", "堪薩斯州": "堪萨斯州", "new south wales": "新南威尔士州",

    // 乌兹别克斯坦（Uzbekistan） - UZ
    "tashkent": "塔什干",
  };

  para = para ? para.toLowerCase().trim() : para;
  para = para.normalize('NFD').replace(/[\u0300-\u036f]/g, "");
  return areaMap[para] || para || "region0";
};

function City_ValidCheck(para) {
  const cityMap = {
    "abadou": "豪兹省",
    "ampang": "安邦",
    "ashburn": "阿什本",
    "badaganhatti": "巴特那",
    "cedar knolls": "雪松诺尔斯",
    "chiyoda": "千代田区",
    "cyberjaya": "赛城",
    "changhua": "彰化市",
    "dublin": "都柏林",
    "frankfurtammain": "法兰克福",
    "gallarate": "加拉拉泰市",
    "haibatrung": "海巴仲区",
    "hanam": "韩南市",
    "Harlesden": "哈里斯登",
    "jessheim": "耶瑟海姆",
    "kocasinan": "科卡西楠市",
    "kyiv": "基辅",
    "lampa": "拉帕",
    "lidodiostia": "丽都迪奥斯蒂亚",
    "melton": "墨尔顿",
    "meppel": "梅珀尔",
    "meyzieu": "梅济约",
    "milan": "米兰",
    "mumbai": "孟买",
    "muhadhdhib": "马什哈德",
    "negishi": "根岸",
    "odai": "奥拉迪亚",
    "okubo-naka": "大久保中",
    "paju": "坡州市",
    "pomichna": "波米奇纳",
    "queretaro": "克雷塔罗市",
    "reston": "里斯顿",
    "roshha‘ayin": "罗什艾因",
    "rucka": "鲁茨卡",
    "reynoldsburg": "雷诺兹堡",
    "santacruz": "圣克鲁斯",
    "sha`ibalmalqah": "沙伊布·阿尔·马尔卡",
    "shibuya": "涩谷区",
    "singera": "摩尔多瓦",
    "sofia-capital": "索菲亚市",
    "songpa-gu": "松坡区",
    "steninge": "斯特宁厄",
    "szigetszentmiklos": "锡盖特圣米克洛什市",
    "sheungwan":"上环",
    "shinagawa": "品川区",
    "southfulton": "南富尔顿",
    "Sao Paulo": "圣保罗"，
    "tashkent": "塔什干",
    "tassin-la-demi-lune": "塔桑拉德米吕讷市",
    "tsuenwan": "荃湾",
    "tokyo": "东京都",
    "thanhxuan": "清宣区",
    "Tiruvānmiyūr": "泰尔万米尤尔",
    "umraniye": "乌姆兰尼耶",
    "vinhedo": "维涅多",
    "yerevan": "叶里温",
    "yeongdong-gun": "永同郡",
    "奧奈叢林": "奥奈丛林",
    "波特蘭": "波特兰",
    "班加羅爾": "班加罗尔",
    "查馬丁區": "查马丁区",
    "達拉斯": "达拉斯",
    "福岡市": "福冈市",
    "聖荷西": "圣荷西",
    "盧森堡市": "卢森堡市",
    "臺北市": "台北市",
    "臺中市": "台中市",
    "西雅圖": "西雅图",
    "新孟買": "新孟买",
    "彰化": "彰化市",
    "中壢": "中坜区",
};

  para = para.replace(/\s+/g, ''); 
  para = para ? para.toLowerCase().trim().normalize('NFKD').replace(/[\u0300-\u036f]/g, '') : para;
  return cityMap[para] || para || city0;
};

function ISP_ValidCheck(para) {
  return para || ips0;
};
